target = '-‑AΑАBΒВCСEΕЕHΗНIΙKΚMΜМNΝOΟОPΡРTΤТXΧХYΥZΖaаcсeеoоpрxхyуËЁÐĐëёΓГΠПᄀᆨㄱᄁᆩㄲᄂᆫᄄퟍᄅᆯᄆᆷᄇᆸᄈퟦᄊᆻㅆᄋᆼㅇᄌᆽㅈᄍㅉퟹᄎᆾᄏᆿᄐᇀᄑᇁㅍᄒᇂᄔᇿᄛퟝᄜᇜᄝᇢᄠퟣᄡㅄᄣퟧᄧㅶퟨᄫᇦᄭᇧᄰᇩᄱퟪᄲㅽᄶퟯᄹퟱᅀᇫᅗᇴᅙᇹᅝᆭᅞᇋᅥㅓᅫㅙᅬㅚᅯㅝᅰㅞᅴㅢᅵㅣᆪㄳᆮㄷᆰꥤᆱꥨᆲꥩᆳꥬᆺㅅᇇㅧᇌㅩᇎꥦᇕꥫᇘꥮᇝꥱᇥꥴ‒–…⋯‵｀⃝◯−－∕／〈〈〉〉⸺⸻⺂乛⺃乚⺅亻⺉刂⺋㔾⺎兀⺏尣⺐⼪尢⺒巳⺓⼳幺⺔彑⺖忄⺘扌⺙攵⺛旡⺞歺⺟母⺠民 ⺡氵⺣灬⺤爫⺦丬⺨犭⺫⺲罒⺭礻⺯糹⺰纟⺱罓⺹耂⺺肀⺾艹⺿艹⻀艹⻂衤⻃覀⻄西⻅见⻈讠⻉贝⻋车⻌辶⻍辶⻐钅⻑⾧長⻒镸⻓长⻔门⻖阝⻘青⻙韦⻚页⻛风⻜飞⻝食⻟飠⻠饣⻢马⻥鱼⻦鸟⻧卤⻨麦⻩黄⻪黾⻫斉⻬齐⻭歯⻮齿⻯竜⻰龙⻲亀⻳龟⼀㆒一⼁丨⼂丶⼃丿⼄乙⼅亅⼆二⼇亠⼈㆟人⼉儿⼊入⼋八⼌冂⼍冖⼎冫⼏几⼐凵⼑刀⼒力力⼓勹⼔匕⼕匚⼖匸⼗十⼘卜⼙卩⼚厂⼛厶⼜又⼝口⼞囗⼟土⼠士⼡夂⼢夊⼣夕⼤大⼥女女⼦子⼧宀⼨寸⼩小⼫尸⼭山⼮巛⼯工⼰己⼱巾⼲干⼴广⼵廴⼶廾⼷弋⼸弓⼹彐⼺彡⼻彳⼼心⼽戈⼾戶⼿手⽀支⽁攴⽂文⽃斗⽄斤⽅方⽆无⽇日⽈曰⽉月⽊木⽋欠⽌止⽍歹⽎殳⽏毋⽐比⽑毛⽒氏⽓气⽔水⽕火⽖爪⽗父⽘爻⽙爿⽚片⽜牛⽝犬⽞玄⽟玉⽠瓜⽡瓦⽢甘⽣生⽤用⽥田⽦疋⽧疒⽨癶⽩白⽪皮⽫皿⽬目⽭矛⽮矢⽯石⽰示⽱禸⽲禾⽴立立⽵竹⽶米⽷糸⽸缶⽹网⽺羊⽼老老⽽而⽾耒⽿耳⾀聿⾁肉⾂臣⾃自⾄至⾅臼⾆舌⾈舟⾉艮⾊色⾋艸⾌虍⾍虫⾎血⾏行行⾐衣⾑襾⾒見見⾓角⾔言⾕谷⾖豆⾗豕⾘豸⾙貝⾚赤⾛走⾜足⾝身⾞車車⾟辛⾠辰辰⾡辵⾢邑⾣酉⾤釆⾥里里⾦金金⾨門⾩阜⾪隶⾫隹⾬雨⾭靑⾮非⾯面⾰革⾱韋⾲韭⾳音⾴頁⾵風⾶飛⾸首⾹香⾺馬⾻骨⾼高⾽髟⾾鬥⾿鬯⿀鬲⿁鬼⿂魚⿃鳥⿄鹵⿅鹿鹿⿆麥⿈黃⿉黍⿊黑⿋黹⿌黽⿍鼎⿎鼓⿏鼠⿑齊⿒齒⿓龍龍⿕龠〜～゙゛゚゜レ㆑ㄪ万ㄫ兀㆔三㆕四㆖上㆘下㆝天㖈䎛㘽㦳㬻䐠不不串串丹丹亂亂了了亮亮什什令令來來例例侮侮便便倫倫僚僚僧僧兩兩六六冷冷凉凉凌凌凜凜凞凞切切列列利利刺刺劉劉劣劣勉勉勒勒勞勞勤勤勵勵北北匿匿卑卑卵卵參參句句吏吏吝吝呂呂咽咽喇喇喝喝嗀嗀嘆嘆器器囹囹塀塀塞塞墨墨壘壘壟壟奈奈契契宅宅寧寧寧寮寮尿尿屢屢層層履履崙崙嵐嵐嶺嶺年年度度廉廉廊廊廓廓廬廬弄弄律律復復念念怒怒怜怜悔悔惡惡慄慄憎憎憐憐懶懶戀戀戮戮拉拉拏拏拓拓拾拾捻捻掠掠撚撚擄擄敏敏數數料料旅旅易易晴晴暈暈暑暑暴暴曆曆更更朗朗李李杻杻林林柳柳栗栗梁梁梅梅梨梨樂樂樂樂樓樓櫓櫓欄欄歷歷殮殮殺殺沈沈泌泌泥泥洛洛洞洞流流浪浪海海淋淋淚淚淪淪渚渚溜溜溺溺滑滑漏漏漢漢漣漣濫濫濾濾炙炙烈烈烙烙煉煉煮煮燎燎燐燐爐爐爛爛牢牢狀狀狼狼猪猪獵獵率率率玲玲珞珞理理琉琉琢琢瑩瑩璉璉璘璘留留略略異異痢痢療療癩癩益益盧盧省省硫硫碌碌碑碑磊磊磻磻礪礪社社祈祈祉祉祐祐祖祖祝祝神神祥祥祿祿禍禍禎禎福福禮禮秊秊稜稜穀穀突突笠笠簾簾籠籠粒粒精精糖糖糧糧紐紐索索累累綠綠綾綾練練練縷縷繁繁署署罹罹羅羅羚羚羽羽者者聆聆聯聯聾聾肋肋臘臘臨臨臭臭良良若若茶茶菉菉菱菱落落葉葉著著蓮蓮蓼蓼藍藍藺藺蘆蘆蘭蘭蘿蘿虜虜螺螺蠟蠟裂裂裏裏裡裡裸裸褐褐襤襤視視說說說諒諒論論諸諸諾諾謁謁謹謹識識讀讀豈豈賂賂賈賈賓賓贈贈路路輦輦輪輪輻輻轢轢連連逸逸遼遼邏邏郎郎郞郞都都酪酪醴醴量量鈴鈴錄錄鍊鍊閭閭阮阮陋陋降降陵陵陸陸隆隆隣隣隷隷隸隸離離難難零零雷雷露露靈靈靖靖領領頻頻類類飯飯飼飼館館駱駱驪驪魯魯鱗鱗鷺鷺鸞鸞麗麗麟麟黎黎龜龜龜ꥡퟏꥢퟐꥣퟒ'

if __name__ == '__main__':
    gets = input()
    flag = False
    for each in gets:
        if each in target:
            flag = True
            break
    print('Yes' if flag else 'No')
